# Создайте программу медицинская анкета, где вы запросите у пользователя такие данные, как имя, фамилию, возраст, и вес.
# И выведите результат согласно которому пациент в хорошем состоянии, если ему до 30 лет и вес от 50 и до 120 кг,
# Пациенту требуется начать вести правильный образ жизни, если ему более 30 и вес меньше 50 или больше 120 кг
# Пациенту требуется врачебный осмотр, если ему более 40 и вес менее 50 или больше 120 кг.
# Все остальные варианты вы можете обработать на ваш вкус и полет фантазии =)
# Формула не отражает реальной действительности и здесь используется только ради примера.

name = input("Введите имя: ")
surname = input("Введите фамилию: ")
age=weight = -1
while age<0:
    age = int(input(surname + " " + name + ", укажите Ваш возраст (положительное число): "))
while weight<0:
    weight = int(input(surname + " " + name + ", укажите Ваш вес (положительное число): "))

if age<30:
    if weight>50 and weight <120:
        print(surname + " " + name + ", вы в хорошем состоянии")
    elif weight <=50:
        print(surname + " " + name + ", надо больше кушать")
    else:
        print(surname + " " + name + ", надо меньше кушать")
else:
    if age<40: # эта ветка для тех кто от 30 до 40 лет
        if weight < 50 or weight > 120:
            print(surname + " " + name + ", нужно вести правильный образ жизни")
        else:
            print(surname + " " + name + ", продолжайте в том же духе")
    else: # эта ветка для тех кто от 40 лет - они относятся и к ктегории от 30 и к категории от 40
        if weight < 50 or weight > 120:
            print(surname + " " + name + ", нужно вести правильный образ жизни, требуется врачебный осмотр")
        else:
            print(surname + " " + name + ", отличные показатели")

