import os
# Задание - 1
# Вам даны 2 списка одинаковой длины, в первом списке имена людей, во втором зарплаты,
# вам необходимо получить на выходе словарь, где ключ - имя, значение - зарплата.
# Запишите результаты в файл salary.txt так, чтобы на каждой строке было 2 столбца,
# столбцы разделяются пробелом, тире, пробелом. в первом имя, во втором зарплата, например: Vasya - 5000
# После чего прочитайте файл, выведите построчно имя и зарплату минус 13% (налоги ведь),
# Есть условие, не отображать людей получающих более зарплату 500000, как именно
#  выполнить условие решать вам, можете не писать в файл
# можете не выводить, подумайте какой способ будет наиболее правильным и оптимальным,
#  если скажем эти файлы потом придется передавать.
# Так же при выводе имя должно быть полностью в верхнем регистре!
# Подумайте вспоминая урок, как это можно сделать максимально кратко, используя возможности языка Python.

people = ["Иван","Сергей","Алексей","Дима","Олег","Света","Оля"]
salary = [100000,200000,300000,400000,500000,600000,350000]
table=dict(zip(people,salary))
with open("salary.txt","w",encoding="UTF-8") as f:
    for name,val in table.items():
        if val<500000:
            f.write(name+" - "+str(val)+"\n")
with open("salary.txt","r",encoding="UTF-8") as f:
    for line in f:
        print(line.strip().split("-")[0].upper(),": ",int(line.strip().split("-")[1])*0.87)


