# Постарайтесь использовать то, что мы прошли на уроке при решении этого ДЗ,
# вспомните про zip(), map(), lambda, посмотрите где лучше с ними, а где они излишни!

# Задание - 1
# Создайте функцию, принимающую на вход Имя, возраст и город проживания человека
# Функция должна возвращать строку вида "Василий, 21 год(а), проживает в городе Москва"

print("Задание 1")
def person(name,age,city):
    return name+", "+str(age)+" год(а), проживает в городе "+city
print(person("Василий",21,"Москва"))



# Задание - 2
# Создайте функцию, принимающую на вход 3 числа, и возвращающую наибольшее из них
print("Задание 2")
def maxnum(a,b,c):
    return max(a,b,c)
print(maxnum(1,2,3))


# Задание - 3
# Создайте функцию, принимающую неограниченное количество строковых аргументов,
# верните самую длинную строку из полученных аргументов
print("Задание 3")
def longer(*args):
    return max(args,key=len)
print(longer("asdf","asdfgh","asdfghjkl"))
