# Все задачи текущего блока решите с помощью генераторов списков!

# Задание-1:
# Дан список, заполненный произвольными целыми числами.
# Получить новый список, элементы которого будут
# квадратами элементов исходного списка
# [1, 2, 4, 0] --> [1, 4, 16, 0]

listin = [1, 2, 4, 0]
listout = [i**2 for i in listin]
print(listin,"-->",listout)

# Задание-2:
# Даны два списка фруктов.
# Получить список фруктов, присутствующих в обоих исходных списках.
list1 = ['яблоко','груша','апельсин','лимон','ананас']
list2 = ['кокос','манго','груша','папайя','лимон','яблоко']
listfruits = [fruit for fruit in list1 if fruit in list2]
print(listfruits)

# Задание-3:
# Дан список, заполненный произвольными числами.
# Получить список из элементов исходного, удовлетворяющих следующим условиям:
# + Элемент кратен 3
# + Элемент положительный
# + Элемент не кратен 4

listnum = [-5,1,-3,2,8,3,-15,4,6,7,9]
listres = [i for i in listnum if i%3==0 and i>0 and i%4!=0]
print(listres)