# Задача-1:
# Напишите небольшую консольную утилиту,
# позволяющую работать с папками текущей директории.
# Утилита должна иметь меню выбора действия, в котором будут пункты:
# 1. Перейти в папку
# 2. Просмотреть содержимое текущей папки
# 3. Удалить папку
# 4. Создать папку
# При выборе пунктов 1, 3, 4 программа запрашивает название папки
# и выводит результат действия: "Успешно создано/удалено/перешел",
# "Невозможно создать/удалить/перейти"

# Для решения данной задачи используйте алгоритмы из задания easy,
# оформленные в виде соответствующих функций,
# и импортированные в данный файл из easy.py
import os
import Lesson5_easy

while True:
    try:
        choice = int(input('Выберите пункт:\n'  
                           '1. Перейти в папку\n'
                           '2. Просмотреть содержимое текущей папки\n'
                           '3. Удалить папку\n'
                           '4. Создать папку\n'
                           '5. Выход\n'
                           '---------------------\n'
                           'Ваш выбор:'))
    except ValueError:
        print('Необходимо ввести число!')
    if choice == 5:
        break
    elif choice == 1:
        name = input('Введите имя папки: ')
        os.chdir(os.path.join(os.getcwd(),name))
        print('Успешно перешел в папку',os.getcwd())
    elif choice == 2:
        for str in os.listdir("."):
            print(str)
    elif choice == 3:
        name = input('Введите имя папки: ')
        Lesson5_easy.rm_dir(name)
        print('Успешно удалил папку')
    elif choice == 4:
        name = input('Введите имя папки: ')
        Lesson5_easy.make_dir(name)
        print('Успешно создал папку')
    else:
        print('Неверный код функции')


